# Temas vistos el 23 de noviembre del 2022
[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/danielroa98/Postgrad-ML/blob/main/Module-1/23_Nov_2022_lec_05_M1G6P_DRG)

Para información adicional de los ejercicios hechos anteriormente, ver el Notebook de la [lectura 4](./16_Nov_2022_lec_04_M1G6P_DRG.ipynb).

In [1]:
import pandas as pd
import numpy as np

In [3]:
emp = pd.read_csv('./Datasets/employees.csv', parse_dates=['hire_date'])
emp.head(6)

,employee_id,first_name,last_name,email,hire_date,department,gender,salary,region_id
0,1,Berrie,Manueau,bmanueau0@dion.ne.jp,2006-04-20,Sports,F,154864,4
1,2,Aeriell,McNee,amcnee1@google.es,2009-01-26,Tools,F,56752,3
2,3,Sydney,Symonds,ssymonds2@hhs.gov,2010-05-17,Clothing,F,95313,4
3,4,Avrom,Rowantree,NaN,2014-02-08,Phones & Tablets,M,119674,7
4,5,Feliks,Morffew,fmorffew4@a8.net,2003-01-14,Computers,M,55307,5
5,6,Bethena,Trow,btrow5@technorati.com,2003-08-06,Sports,F,134501,3

### Continuación de ejercicios...

In [5]:
emp['salary'].describe()

count      1000.000000
mean      91571.594000
std       42028.902067
min       20542.000000
25%       55292.250000
50%       89686.500000
75%      126997.750000
max      166976.000000
Name: salary, dtype: float64

#### 5) Utilizando los valores obtenidos por el método _describe_, construye una función que determine si el salario es:
- 'bajo', si salario <= perecntil 25
- 'medio' si el salario está entre percentil 25 (excluyendo) y el percentil 75 (inclusivo)
- 'alto' si el salario mayor al percentil 75.

In [6]:
def salary_classifier(salary_value):
    if salary_value <= 55292.25:
        return 'bajo'
    elif salary_value <= 126997.75:
        return 'medio'
    else:
        return 'alto'

#### 6) Aplica la función del punto anterior para la columna salary para ver el resultado

In [7]:
emp['salary'].apply(salary_classifier)
# Sintaxis
# serie.apply(nombre_de_la_función)

0       alto
1      medio
2      medio
3      medio
4      medio
       ...
995    medio
996    medio
997     alto
998     bajo
999     bajo
Name: salary, Length: 1000, dtype: object

Se podía definir una columna nueva para guardar estos resultados
```
emp['salary_range'] = emp['salary'].apply(salary_classifier)
```

#### 7) ¿Cuántos salarios bajos, medios y altos hay?

In [8]:
emp['salary'].apply(salary_classifier).value_counts()

medio    500
alto     250
bajo     250
Name: salary, dtype: int64

#### 8) Se quieren los resultados de la pregunta 7 en frecuencias relativas.

In [10]:
emp['salary'].apply(salary_classifier).value_counts(normalize=True)*100

medio    50.0
alto     25.0
bajo     25.0
Name: salary, dtype: float64

#### 9) ¿Cuántos departamentos hay?

In [14]:
emp['department'].nunique()
# Lo anterior es como utilizar emp['department'].unique() y después contarlos.

27

#### 10) Supongamos que a todos los empleados se les dará un aumento del 10%, crear una nueva columna llamada 'new_salary' que contenga el nuevo salario

In [15]:
emp['new_salary'] = emp['salary'].apply(lambda x:x*1.1)

#### Alternativa utilizando broadcasting
```emp['new_salary'] = emp['salary']*1.1```

In [16]:
emp.head()

,employee_id,first_name,last_name,email,hire_date,department,gender,salary,region_id,new_salary
0,1,Berrie,Manueau,bmanueau0@dion.ne.jp,2006-04-20,Sports,F,154864,4,170350.4
1,2,Aeriell,McNee,amcnee1@google.es,2009-01-26,Tools,F,56752,3,62427.2
2,3,Sydney,Symonds,ssymonds2@hhs.gov,2010-05-17,Clothing,F,95313,4,104844.3
3,4,Avrom,Rowantree,NaN,2014-02-08,Phones & Tablets,M,119674,7,131641.4
4,5,Feliks,Morffew,fmorffew4@a8.net,2003-01-14,Computers,M,55307,5,60837.7

#### 11) ¿Cuántos valores nulos tiene la columna 'email'?

In [17]:
emp['email'].isnull().sum()

204

In [18]:
# Utilizando el alias
emp['email'].isna().sum()

204

## Creando un DataFrame, utilizando un diccionario

In [20]:
dic_data = {
    'producto': ['laptop', 'tabler', 'celular', 'reloj'],
    'precio': [3000, 13500, 2800, 19600]
}
df = pd.DataFrame(dic_data)
df

  producto  precio
0   laptop    3000
1   tabler   13500
2  celular    2800
3    reloj   19600

In [21]:
dic_2 = pd.DataFrame(dic_data, index=['prod1', 'prod2', 'prod3', 'prod4'])
dic_2

      producto  precio
prod1   laptop    3000
prod2   tabler   13500
prod3  celular    2800
prod4    reloj   19600

##

In [22]:
emp = pd.read_csv('./Datasets/employees_2.csv')
emp.head(6)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal

In [23]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

Converting to datetime

In [25]:
pd.to_datetime(emp['Start Date'])

0     1993-08-06
1     1996-03-31
2     1993-04-23
3     2005-03-04
4     1998-01-24
         ...
995   2014-11-23
996   1984-01-31
997   2013-05-20
998   2013-04-20
999   2012-05-15
Name: Start Date, Length: 1000, dtype: datetime64[ns]

In [26]:
emp['Start Date'] = pd.to_datetime(emp['Start Date'])
emp['Last Login Time'] = pd.to_datetime(emp['Last Login Time'])

emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-11-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services

In [27]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 62.6+ KB